nxp-mcuxpresso/mcux-sdk-examples/mcxn9xxevk/driver_examples/powerquad/benchmark_vector/cm33_core0/powerquad_benchmark_vector.c
/*
 * Copyright 2019-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"
#include "fsl_powerquad.h"
#include "arm_math.h"
#include "arm_const_structs.h"

/*
 * This test case test the benchmark of the powerquad CMSIS DSP APIs.
 * The result could be compared with the software method using CMSIS DSP.
 */

#include "fsl_clock.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_POWERQUAD POWERQUAD

#define MATRIX_TEST_LOOP 10000
#define MATH_TEST_LOOP   100000
#define FIR_TEST_LOOP    100000
#define FFT_TEST_LOOP    10000
#define VECTOR_TEST_LOOP 10000
#define BIQUAD_TEST_LOOP 10000

#define RFFT_INPUT_LEN 512
#define CFFT_INPUT_LEN 512
#define IFFT_INPUT_LEN 512
#define DCT_INPUT_LEN  512

#define VECTOR_INPUT_LEN 128

#define BIQUAD_CASCADE_STAGE    16
#define BIQUAD_CASCADE_DATA_LEN 128

#define MATRIX_ROW     16
#define MATRIX_COL     16
#define MATRIX_LEN     (MATRIX_COL * MATRIX_ROW)
#define FLOAT_2_Q31(x) ((int32_t)((x)*2147483648.0f))
#define FLOAT_2_Q15(x) (int16_t) __SSAT(((int32_t)((x)*32768.0f)), 16)

#define FIR_INPUT_LEN 16
#define FIR_TAP_LEN   12

#define CONV_A_LEN      5
#define CONV_B_LEN      5
#define CONV_RESULT_LEN (CONV_A_LEN + CONV_B_LEN - 1)

#define CORR_A_LEN      5
#define CORR_B_LEN      5
#define CORR_RESULT_LEN (CORR_A_LEN + CORR_B_LEN - 1)

#define MATH_PI 3.1415926535898

#define PQ_Primitive_Vector32(format, inf)  \
    PQ_Initiate_Vector_Func(pSrc, pDst);    \
    PQ_Vector8_##format(false, false, inf); \
    PQ_Vector8_##format(true, false, inf);  \
    PQ_Vector8_##format(true, false, inf);  \
    PQ_Vector8_##format(true, true, inf);   \
    PQ_End_Vector_Func();

#define EXAMPLE_ASSERT_TRUE(x)            \
    if (!(x))                             \
    {                                     \
        PRINTF("%s error\r\n", __func__); \
        while (1)                         \
        {                                 \
        }                                 \
    }

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/* Vectorized math functions with optimized*/
static void PQ_VectorSqrtQ31Test(void);
static void PQ_VectorSqrtQ15Test(void);
static void PQ_VectorSinF32Test(void);
static void PQ_VectorSinQ31Test(void);
static void PQ_VectorSinQ15Test(void);
static void PQ_VectorCosF32Test(void);
static void PQ_VectorCosQ31Test(void);
static void PQ_VectorCosQ15Test(void);

static void PQ_VectorLnFPTest(void);
static void PQ_VectorLnFXTest(void);
static void PQ_VectorInvFPTest(void);
static void PQ_VectorInvFXTest(void);
static void PQ_VectorSqrtFPTest(void);
static void PQ_VectorSqrtFXTest(void);
static void PQ_VectorInvSqrtFPTest(void);
static void PQ_VectorInvSqrtFXTest(void);
static void PQ_VectorEtoxFPTest(void);
static void PQ_VectorEtoxFXTest(void);
static void PQ_VectorEtonxFPTest(void);
static void PQ_VectorEtonxFXTest(void);
static void PQ_16ByteBiquadCascadedf2FPTest(void);
static void PQ_16ByteBiquadCascadedf2FXTest(void);

/* Old vectorized math functions with optimized*/
static void PQ_VectorLnF32Test(void);
static void PQ_VectorLnQ31Test(void);
static void PQ_VectorInvF32Test(void);
static void PQ_VectorInvQ31Test(void);
static void PQ_VectorSqrtF32Test(void);
static void PQ_VectorSqrtQ31Test(void);
static void PQ_VectorInvSqrtF32Test(void);
static void PQ_VectorInvSqrtQ31Test(void);
static void PQ_VectorEtoxF32Test(void);
static void PQ_VectorEtoxQ31Test(void);
static void PQ_VectorEtonxF32Test(void);
static void PQ_VectorEtonxQ31Test(void);
static void PQ_BiquadCascadedf2F32Test(void);
static void PQ_BiquadCascadedf2Q31Test(void);

static void TEST_InitTime(void);
static uint32_t TEST_GetTime(void);

static void PQ_Vector16BiquadDf2FX(int32_t *pSrc, int32_t *pDst);
static void PQ_16ByteBiquadCascadeDf2FX(const pq_biquad_cascade_df2_instance *S,
                                        int32_t *pSrc,
                                        int32_t *pDst,
                                        uint32_t blockSize);
static void PQ_Vector16BiquadCascadeDf2FX(int32_t *pSrc, int32_t *pDst);
static void PQ_16ByteBiquadCascadeDf2FP(const pq_biquad_cascade_df2_instance *S,
                                        float *pSrc,
                                        float *pDst,
                                        uint32_t blockSize);
static void PQ_Vector16BiquadDf2FP(float *pSrc, float *pDst);
static void PQ_Vector16BiquadCascadeDf2FP(float *pSrc, float *pDst);
static void PQ_Vector32EtonxFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32EtonxFP(float *pSrc, float *pDst);
static void PQ_Vector32EtoxFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32InvSqrtFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32LnFP(float *pSrc, float *pDst);
static void PQ_Vector32LnFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32InvFP(float *pSrc, float *pDst);
static void PQ_Vector32InvFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32SqrtFP(float *pSrc, float *pDst);
static void PQ_Vector32SqrtFX(int32_t *pSrc, int32_t *pDst);
static void PQ_Vector32InvSqrtFP(float *pSrc, float *pDst);
static void PQ_Vector32EtoxFP(float *pSrc, float *pDst);

/*******************************************************************************
 * Variables
 ******************************************************************************/

static volatile uint32_t s_timeMs;

/*******************************************************************************
 * Code
 ******************************************************************************/

/*
 * @brief Main function
 */
int main(void)
{
    /* attach FRO 12M to FLEXCOMM4 (debug console) */
    CLOCK_SetClkDiv(kCLOCK_DivFlexcom4Clk, 1u);
    CLOCK_AttachClk(BOARD_DEBUG_UART_CLK_ATTACH);

    BOARD_InitPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();

